---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SlantedColumnEndCutPlaneIsParallelToGeometry
source: html/832d7ad3-1ccf-da88-a40f-2651149f7bbc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.SlantedColumnEndCutPlaneIsParallelToGeometry Property

Cut plane of slanted column end is parallel to the location curve.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlantedColumnEndCutPlaneIsParallelToGeometry { get; }
```